ERP.belugaerp/src/DataProcessors/бг_ФормированиеЗаказовПоставщикам/бг_ФормированиеЗаказовПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бг_ФормированиеЗаказовПоставщикам</name>
</mdclass:DataProcessor>

ERP.belugaerp/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЗагруженИзТОиР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КоличествоБутылок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбъемБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОплатаЗаПоставкуПослеРеализацииТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОснованиеЗаказа</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПунктПогрузки</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СозданНаОснованииЗаказовКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлительностьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>бг_КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_УпаковкаПаллета</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/DataProcessors/бг_ФормированиеЗаказовПоставщикам/Forms/Форма/Module.bsl
#Область ОбработчикиСОбытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("АдресДанныхОтчета") 
		Или ПустаяСтрока(Параметры.АдресДанныхОтчета) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДанныхОтчета = ПолучитьИзВременногоХранилища(Параметры.АдресДанныхОтчета);	
	ТаблицаДанныхОтчета.Свернуть(
		"ЗаказНаОтгрузкуОрганизация,Номенклатура", 
		"ОсталосьОбеспечить");
	
	ДанныеОтчета.Загрузить(ТаблицаДанныхОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьЗаказыПоставщикамПоДаннымОтчета(Команда)
	
	СформироватьЗаказыПоставщикамПоДаннымОтчетаНаСервере();
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементофФормыТаблицаСозданныеЗаказы

&НаКлиенте
Процедура СозданныеЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбраннаяСтрока = СозданныеЗаказы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ДанныеСтроки = Новый Структура("Организация,Контрагент,ЗаказПоставщику");
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, ВыбраннаяСтрока);
	
	Для Каждого КлючИЗначение Из ДанныеСтроки Цикл
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
		ПоказатьЗначение(, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьЗаказыПоставщикамПоДаннымОтчетаНаСервере()
	
	ДеревоЗначений = РеквизитФормыВЗначение("СозданныеЗаказы", Тип("ДеревоЗначений"));
	
	ВыборкаПоОрганизации = ДанныеФормированияЗаказов();
	
	Пока ВыборкаПоОрганизации.Следующий() Цикл
		
		ВыборкаПоКонтрагенту = ВыборкаПоОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		РодительскаяСтрокаОрганизация = ДеревоЗначений.Строки.Добавить();
		РодительскаяСтрокаОрганизация.Организация = ВыборкаПоОрганизации.Организация;
		
		Пока ВыборкаПоКонтрагенту.Следующий() Цикл
			
			РодительскаяСтрокаКонтрагент = РодительскаяСтрокаОрганизация.Строки.Добавить();
			РодительскаяСтрокаКонтрагент.Контрагент = ВыборкаПоКонтрагенту.Контрагент;
			
			ЗаказПоставщикуОбъект = Документы.ЗаказПоставщику.СоздатьДокумент();
			ЗаказПоставщикуОбъект.Дата = ТекущаяДатаСеанса();
			ЗаказПоставщикуОбъект.Контрагент = ВыборкаПоКонтрагенту.Контрагент;
			ЗаказПоставщикуОбъект.Партнер = ВыборкаПоКонтрагенту.Партнер;
			ЗаказПоставщикуОбъект.Организация = ВыборкаПоОрганизации.Организация;
			
			ЗаказПоставщикуОбъект.Заполнить(Неопределено);
			
			ВыборкаДетальныеЗаписи = ВыборкаПоКонтрагенту.Выбрать();
			
			ЗаполнитьТабличнуюЧастьЗаказа(ЗаказПоставщикуОбъект, ВыборкаДетальныеЗаписи);
			
			ЗаказПоставщикуОбъект.ЗаполнитьУсловияЗакупокПоУмолчанию();
			
			ЗаказПоставщикуСсылка = Неопределено;
		
			Попытка
				ЗаказПоставщикуОбъект.Записать();
				ЗаказПоставщикуСсылка = ЗаказПоставщикуОбъект.Ссылка;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(
					ПодробноеПредставлениеОшибки(
						ИнформацияОбОшибке()));	
			КонецПопытки;
					
			Если ЗаказПоставщикуСсылка <> Неопределено Тогда
				СтрокаЗаказ = РодительскаяСтрокаКонтрагент.Строки.Добавить();
				СтрокаЗаказ.ЗаказПоставщику = ЗаказПоставщикуСсылка;
			Иначе
				ДеревоЗначений.Строки.Удалить(РодительскаяСтрокаОрганизация);	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ДеревоЗначений, СозданныеЗаказы);

	Элементы.СформироватьЗаказыПоставщикамПоДаннымОтчета.Доступность = Не ДеревоЗначений.Строки.Количество() > 0;	
	
КонецПроцедуры

&НаСервере
Функция ДанныеФормированияЗаказов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеОтчета.ЗаказНаОтгрузкуОрганизация КАК Организация,
		|	ДанныеОтчета.Номенклатура КАК Номенклатура,
		|	ДанныеОтчета.ОсталосьОбеспечить КАК Количество
		|ПОМЕСТИТЬ ДанныеОтчета
		|ИЗ
		|	&ДанныеОтчета КАК ДанныеОтчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеОтчета.Организация КАК Организация,
		|	ДанныеОтчета.Номенклатура.бг_ОсновнойПоставщик КАК Контрагент,
		|	ДанныеОтчета.Номенклатура.бг_ОсновнойПоставщик.Партнер КАК Партнер,
		|	ДанныеОтчета.Номенклатура КАК Номенклатура,
		|	СУММА(ДанныеОтчета.Количество) КАК Количество
		|ИЗ
		|	ДанныеОтчета КАК ДанныеОтчета
		|СГРУППИРОВАТЬ ПО
		|	ДанныеОтчета.Организация,
		|	ДанныеОтчета.Номенклатура.бг_ОсновнойПоставщик,
		|	ДанныеОтчета.Номенклатура.бг_ОсновнойПоставщик.Партнер,
		|	ДанныеОтчета.Номенклатура	
		|ИТОГИ
		|	МАКСИМУМ(Партнер)
		|ПО 
		|	Организация,
		|	Контрагент";
	
	Запрос.УстановитьПараметр("ДанныеОтчета", ДанныеОтчета.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЗаказа(ЗаказПоставщикуОбъект, ВыборкаДетальныеЗаписи)

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
		НоваяСтрока = ЗаказПоставщикуОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество;
		НоваяСтрока.КоличествоУпаковок = ВыборкаДетальныеЗаписи.Количество;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
